Revit 2026 API

# IFCDataGetTypeList Method

---

Gets the multiple strings represent one IFC type name.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<string> GetTypeList()
```
```vb
Public Function GetTypeList As IList(Of String)
```
```cpp
public:
IList<String^>^ GetTypeList()
```
```fsharp
member GetTypeList : unit -> IList<string>
```

#### Return Value

IListString The strings.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | No type assigned or it is a simple type. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace